stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_ll_lptim.h
/** @defgroup LPTIM_LL_EC_CLK_SOURCE Clock Source
  * @{
  */
#define LL_LPTIM_CLK_SOURCE_INTERNAL          0x00000000U      /*!<LPTIM is clocked by internal clock source (APB clock or any of the embedded oscillators)*/
#define LL_LPTIM_CLK_SOURCE_EXTERNAL          LPTIM_CFGR_CKSEL /*!<LPTIM is clocked by an external clock source through the LPTIM external Input1*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_CLK_FILTER Clock Filter
  * @{
  */
#define LL_LPTIM_CLK_FILTER_NONE              0x00000000U        /*!<Any external clock signal level change is considered as a valid transition*/
#define LL_LPTIM_CLK_FILTER_2                 LPTIM_CFGR_CKFLT_0 /*!<External clock signal level change must be stable for at least 2 clock periods before it is considered as valid transition*/
#define LL_LPTIM_CLK_FILTER_4                 LPTIM_CFGR_CKFLT_1 /*!<External clock signal level change must be stable for at least 4 clock periods before it is considered as valid transition*/
#define LL_LPTIM_CLK_FILTER_8                 LPTIM_CFGR_CKFLT   /*!<External clock signal level change must be stable for at least 8 clock periods before it is considered as valid transition*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_CLK_POLARITY Clock Polarity
  * @{
  */
#define LL_LPTIM_CLK_POLARITY_RISING          0x00000000U        /*!< The rising edge is the active edge used for counting*/
#define LL_LPTIM_CLK_POLARITY_FALLING         LPTIM_CFGR_CKPOL_0 /*!< The falling edge is the active edge used for counting*/
#define LL_LPTIM_CLK_POLARITY_RISING_FALLING  LPTIM_CFGR_CKPOL_1 /*!< Both edges are active edges*/
/**
  * @}
  */

/** @defgroup LPTIM_LL_EC_ENCODER_MODE Encoder Mode
  * @{
  */
#define LL_LPTIM_ENCODER_MODE_RISING          0x00000000U        /*!< The rising edge is the active edge used for counting*/
#define LL_LPTIM_ENCODER_MODE_FALLING         LPTIM_CFGR_CKPOL_0 /*!< The falling edge is the active edge used for counting*/
#define LL_LPTIM_ENCODER_MODE_RISING_FALLING  LPTIM_CFGR_CKPOL_1 /*!< Both edges are active edges*/
/**
  * @}
  */

/** @defgroup LPTIM_EC_INPUT1_SRC Input1 Source
  * @{
  */
#define LL_LPTIM_INPUT1_SRC_GPIO         0x00000000UL                 /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#define LL_LPTIM_INPUT1_SRC_COMP1        0x00000000UL                 /*!< For LPTIM1, LPTIM2 and LPTIM3 */
#if defined(COMP2)
#define LL_LPTIM_INPUT1_SRC_COMP2        0x00000000UL                 /*!< For LPTIM2 */
#define LL_LPTIM_INPUT1_SRC_COMP1_COMP2  (LPTIM_CFGR2_IN1SEL_1 | LPTIM_CFGR2_IN1SEL_0)          /*!< For LPTIM2 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_INPUT2_SRC Input2 Source
  * @{
  */
#define LL_LPTIM_INPUT2_SRC_GPIO         0x00000000UL                  /*!< For LPTIM1 and LPTIM3 */
#if defined(COMP2)
#define LL_LPTIM_INPUT2_SRC_COMP2        LPTIM_CFGR2_IN2SEL_0          /*!< For LPTIM1 and LPTIM3 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC1_RMP LPTIM1 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC1_RMP_GPIO     0x00000000UL                 /*!< IC1 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC1_RMP_COMP1    LPTIM_CFGR2_IC1SEL_0         /*!< IC1 connected to COMP1 */
#if defined(COMP2)
#define LL_LPTIM_LPTIM1_IC1_RMP_COMP2    LPTIM_CFGR2_IC1SEL_1         /*!< IC1 connected to COMP2 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC2_RMP LPTIM1 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC2_RMP_GPIO     0x00000000UL                 /*!< IC2 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC2_RMP_MCO1     LPTIM_CFGR2_IC2SEL_0         /*!< IC2 connected to MCO1 */
#define LL_LPTIM_LPTIM1_IC2_RMP_MCO2     LPTIM_CFGR2_IC2SEL_1         /*!< IC2 connected to MCO2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC3_RMP LPTIM1 Input Ch3 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC3_RMP_GPIO     0x00000000UL                 /*!< IC3 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC3_RMP_COMP1    LPTIM_CFGR2_IC3SEL_0         /*!< IC3 connected to COMP1 */
#if defined(COMP2)
#define LL_LPTIM_LPTIM1_IC3_RMP_COMP2    LPTIM_CFGR2_IC3SEL_1         /*!< IC3 connected to COMP2 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM1_IC4_RMP LPTIM1 Input Ch4 Remap
  * @{
  */
#define LL_LPTIM_LPTIM1_IC4_RMP_GPIO     0x00000000UL                 /*!< IC4 connected to GPIO */
#define LL_LPTIM_LPTIM1_IC4_RMP_COMP1    LPTIM_CFGR2_IC4SEL_0         /*!< IC4 connected to COMP1 */
#if defined(COMP2)
#define LL_LPTIM_LPTIM1_IC4_RMP_COMP2    LPTIM_CFGR2_IC4SEL_1         /*!< IC4 connected to COMP2 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM2_IC1_RMP LPTIM2 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM2_IC1_RMP_GPIO     0x00000000UL                 /*!< IC1 connected to GPIO */
#define LL_LPTIM_LPTIM2_IC1_RMP_COMP1    LPTIM_CFGR2_IC1SEL_0         /*!< IC1 connected to COMP1 */
#if defined(COMP2)
#define LL_LPTIM_LPTIM2_IC1_RMP_COMP2    LPTIM_CFGR2_IC1SEL_1         /*!< IC1 connected to COMP2 */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM2_IC2_RMP LPTIM2 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM2_IC2_RMP_GPIO     0x00000000UL                                  /*!< IC2 connected to GPIO */
#define LL_LPTIM_LPTIM2_IC2_RMP_MCO1     LPTIM_CFGR2_IC2SEL_0                          /*!< IC2 connected to MCO1 */
#define LL_LPTIM_LPTIM2_IC2_RMP_MCO2     LPTIM_CFGR2_IC2SEL_1                          /*!< IC2 connected to MCO2 */
/**
  * @}
  */

#if defined(LPTIM3)
/** @defgroup LPTIM_EC_LPTIM3_IC1_RMP LPTIM3 Input Ch1 Remap
  * @{
  */
#define LL_LPTIM_LPTIM3_IC1_RMP_GPIO     0x00000000UL                                  /*!< IC1 connected to GPIO */
#define LL_LPTIM_LPTIM3_IC1_RMP_COMP1    LPTIM_CFGR2_IC1SEL_0                          /*!< IC1 connected to COMP1 */
#define LL_LPTIM_LPTIM3_IC1_RMP_COMP2    LPTIM_CFGR2_IC1SEL_1                          /*!< IC1 connected to COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM3_IC2_RMP LPTIM3 Input Ch2 Remap
  * @{
  */
#define LL_LPTIM_LPTIM3_IC2_RMP_GPIO           0x00000000UL                            /*!< IC2 connected to GPIO */
#define LL_LPTIM_LPTIM3_IC2_RMP_MCO1           LPTIM_CFGR2_IC2SEL_0                    /*!< IC2 connected to MCO1 */
#define LL_LPTIM_LPTIM3_IC2_RMP_MCO2           LPTIM_CFGR2_IC2SEL_1                    /*!< IC2 connected to MCO2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM3_IC3_RMP LPTIM3 Input Ch3 Remap
  * @{
  */
#define LL_LPTIM_LPTIM3_IC3_RMP_GPIO     0x00000000UL                 /*!< IC3 connected to GPIO */
#define LL_LPTIM_LPTIM3_IC3_RMP_COMP1    LPTIM_CFGR2_IC3SEL_0         /*!< IC3 connected to COMP1 */
#define LL_LPTIM_LPTIM3_IC3_RMP_COMP2    LPTIM_CFGR2_IC3SEL_1         /*!< IC3 connected to COMP2 */
/**
  * @}
  */

/** @defgroup LPTIM_EC_LPTIM3_IC4_RMP LPTIM3 Input Ch4 Remap
  * @{
  */
#define LL_LPTIM_LPTIM3_IC4_RMP_GPIO     0x00000000UL                 /*!< IC4 connected to GPIO */
#define LL_LPTIM_LPTIM3_IC4_RMP_COMP1    LPTIM_CFGR2_IC4SEL_0         /*!< IC4 connected to COMP1 */
#define LL_LPTIM_LPTIM3_IC4_RMP_COMP2    LPTIM_CFGR2_IC4SEL_1         /*!< IC4 connected to COMP2 */
/**
  * @}
  */
#endif /*LPTIM3 */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup LPTIM_LL_Exported_Macros LPTIM Exported Macros
  * @{
  */

